#2. Создайте класс Math.
# a. Создайте два атрибута — a и b.
# b. Напишите методы
# i. addition — сложение,
# ii. multiplication — умножение,
# iii. division — деление,
# iv. subtraction — вычитание.
# При передаче в методы параметров a и b с ними нужно производить соответствующие действия и печатать ответ.



class Math:
#конструктор класса

    def addition (a, b): #сложение
        return a + b

    def multiplication (a, b): #умножение
        return a * b

    def division (a, b): #деление
        return a / b

    def subtraction (a, b): #вычитание
        return a - b

a = int(input('Введите первое число '))

b = int(input('Введите второе число '))

print(Math.addition(a, b))
print(Math.multiplication(a, b))
print(Math.division(a, b))
print(Math.subtraction(a, b))



